# -*- coding: utf-8 -*-
"""
Created on Sun Mar 21 16:16:50 2021

@author: user

1.由使用者輸入獲利金額
2.含10萬以內,獎金10%
ex 10萬   10000

3.10萬1元~20萬,(低於10萬,獎金10%,勝的7%)
ex 18萬  10萬=1萬  +  8萬=5600   ==1萬5千6百元 

4.20~40萬(低於10萬獎金10%,10萬7%,勝的3%)
ex 28萬  10萬=1萬 +  10萬=7000 8萬 =2400  == 1萬9千4百元

"""
bonus = 0

m = int(input("請輸入獲利金額(單位:萬元):"))
money = m*10000

if money <= 100000:
    a = money *0.1 
    bonus = a

elif money <= 200000 or money > 100000:
    b1 = 10000*0.1
    b2 = (money-10000)*0.07
    
    b = b1+b2
    bonus = b

else :
    c1 = 10000*0.1
    c2 = 10000*0.07
    c3 = (money -200000)*0.03
    
    c = c1 + c2 + c3
    bonus = c
    
print("你獲得的獎金為：%.f"%(bonus))
    
    
    
